[[{"website": "http://akronsbdc.org/calendar/", "description": "The fundamentals for those interested in starting their own business or for those who have recently started a business, whether a commercial lease or a home-based operation. Learn about the planning process, initial financial projections, ownership options, review of the required forms, licensing, loan options and additional funding availability. Participants will receive the business plan outline during the session.Seminar is free, but advance registration is required in order to issue parking passes and ensure adequate seating and training materials. To register, please call 330.375.2111, or email info@akronsbdc.org .Take elevator to “M” Floor for Conference Room #904 Presented byJim Griggy, CBA, for the Ohio Small Business Development Center (OSBDC) at the Summit Medina Business Alliance (SMBA)andMark Hansel, Lender Relations Rep for the Cleveland District Office of the U.S. Small Business Administration.", "title": "Business Basics", "location": "@ Akron Global Business Accelerator, \"M\" Floor Conference Room #904", "time": "2:00pm", "date": "11-15"}, {"website": "http://akronsbdc.org/calendar/", "description": "The most important aspect of a business plan is to serve as a guide during the life of your business. It is the blueprint of your business and will serve to keep you on track. This workshop will not only teach you how to write a business plan, it will show you the value of having a business plan and keeping it current. Seminar is free, but advance registration is required in order to issue parking passes and ensure adequate seating and training materials. To register, please call 330.375.2111, or email info@akronsbdc.org.Seminar begins promptly at 10 am. Take elevator to “M” Floor Conference Room #904 Presented byBrian Walters, MBA, CBA for the Summit Medina Business AllianceandMark Hansel, Cleveland District Office of the SBA, Dept. of Economic Development/Lender Relations", "title": "How to Write a Business Plan", "location": "@ Akron Global Business Accelerator, \"M\" Floor Conference Room #904", "time": "10:00am", "date": "11-16"}], [{"website": "https://akron.score.org/content/take-workshop-282", "description": "Whether you are actively looking for a business to buy, or just wondering how to get started, this free session, presented by FranNet, answers questions such as:  What are the adva Read more", "title": "Small Business, Big Potential", "location": "570 E. Waterloo Road", "time": " 6:30pm", "date": "11-9"}, {"website": "https://akron.score.org/content/take-workshop-282", "description": "Want to start your own business?  Don't know where to start?  This free workshop covers  how to start and market a business. Read more", "title": "Starting Your Own Business  11-14-17", "location": "225 S. Main Street", "time": " 5:30pm", "date": "11-14"}, {"website": "https://akron.score.org/content/take-workshop-282", "description": "Do you understand your business\u0092 financial statements and how they impact your \r\nbusiness? Read more", "title": "Fundamentals of Financial Management - Wooster 11-14-17", "location": "220 W. Liberty Street", "time": " 6:00pm", "date": "11-14"}, {"website": "https://akron.score.org/content/take-workshop-282", "description": "An in-depth review of financial management for the existing business or serious entrepreneur in the pre-start-up mode. Read more", "title": "Fundamentals of Financial Management - 11-15-17", "location": "225 S. Main St.", "time": " 5:30pm", "date": "11-15"}]]